step-by-step/030-populate-database/020-soap/1500-устройства/0100.xml

<?xml version="1.0" ?>
<!-- Модули -> Интернет -> Устройства и ресурсы -> Дерево -> Вставить из библиотеки -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:inetDeviceUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.api.inet.modules.bgbilling.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <inetDevice deviceTypeId="0" entityId="0" entitySpecId="0" id="0" ident="Core"
                        invDeviceGroupIds="" invDeviceId="2" invDeviceTypeId="0" invHost=""
                        invIdent="Core" omDisabled="false" parentId="1" password="" secret="">
                <comment></comment>
                <config></config>
                <host></host>
                <username></username>
                <invConfig></invConfig>
            </inetDevice>
            <updateInvDevice>false</updateInvDevice>
        </ns5:inetDeviceUpdate>
    </S:Body>
</S:Envelope>
